class quotations {
  String _q1 = 'السعاده هي التلذذ بالمصاعب';
  String _q2 = 'تعلم كيف تدير وقت ضعفك و فراغك';
  String _q3 =
      'لا تفكر كثيرا لكن استغفر كثيرا ، فالله يفتح بالاستغفار ابوابا لاتفتح بالتفكير';
  String _q4 = 'صيد الغزال احلى من اكله';
  String _q5 =
      'ليس هناك أسرار للنجاح. انه نتيجة التحضير، والعمل الجاد، والتعلم من الأخطاء';
  String _q6 = ' الخوف لا يأتي من مصدر خارجي ، الخوف يأتي من الداخل ';
  String _q7 = 'بعض الناس يأخذون أحلامهم معهم إلى القبر';
  String _q8 = 'لا تبكي لأن الأمر قد انتهى ، ابتسم لأنه قد حدث';
  String _q9 = 'إذا تعلمت من فشلك، فهذا يعني أنك لم تفشل أبدًا';
  String _q10 = 'لا تحاول أن تسعى إلى النجاح، ولكن كن إنسانًا ذو قيمة';
  String _q11 = 'قيمة النجاح تكون في نهوضك وقيامك بعد كل أمر تعثرت به';
  String _q12 = 'قد أبدو أنني أسير ببطء، ولكني لم أسر مرة إلى الخلف ';

  String _q14 = 'الشيء الضروري واللازم للنجاح هو التوكل على الله و  المثابرة ';
  String _q15 =
      'من أهم الأشياء التي تجعلك تنجح في جميع علاقاتك الإنسانية سواء العمل، السياسة، التجارة  أو الدراسة هو التركيز';
  String _q16 =
      'قال نيلسون مانديلا إن تفوقه الشديد بالمدرسة لم يكن نتيجة لنبوغه، ولكن راجع إلى الإصرار على النجاح';
  String _q17 =
      'عندما ترى نجاحك قد تحقق عندما فشل الآخرين، فاعلم أنه ليس نجاح وأنه فشل ارتدى ثياب النصر ';
  String _q18 =
      'لا أعرف الكثير عن قواعد النجاح، ولكن أعرف أول وأهم قواعد الفشل وهي محاولتك الدائمة لإرضاء الآخرين ';

  String _q20 =
      'من الجيد الاحتفال بالنجاح ولكن الأهم استخلاص العبر والدروس من الفشل ';
  String _q21 = 'النجاح.. هو أن تنتقل من فشل إلى فشل بدون أن تفقد حماسك ';
  String _q22 =
      '‏الشجاعة لا تعني أن لا تخاف شيئًا , الشجاعة تعني أن تكون خائفًا، خائفًا حقًا، ومع ذلك ورغم كل شيء تفعل ما تراه صوابًا.';
  String _q23 =
      'أن تحقق هدفًا صغيرًا كل يوم يعلو بك على سُلَّم النجاح خير لك من الوقوف في مكانك وانتظار المجهول';
  String _q24 =
      '‏تمضي بنا ايام العمر سراعا  فما الحياةُ سوى رحله نعبرها بقارب الأمل  فمهما بلغ بك التعثر والشتات لا تيأس  فما ذبلت عينٌ إلا وفوقها ربٌ يُخبئ لها الأجمل ';
  String _q25 = 'أيامك الصعبة التي تمر بها ستصنع منك شخصًا قويًّا لا يُكسر';
  String _q26 =
      'إما أن هذا العالم ازداد تفاهة أو أنني قد أصبت بالجدية أكثر من اللازم ، وكلاهما مخيف جداً';
  String _q27 = 'إما أن تُقاوم، أو تتظاهر بأنك تُقاوم، لكن لا تنحنِ أبداً';
  String _q28 =
      'دراستك صعبة وتشعر بثقل الأيام؟ النجاح لا يأتي بسهولة لكنَّه يستحق التعب، حان وقت العطاء لجني الثِّمار';
  String _q29 = 'إملأ وقت فراغك بالإستغفار و الذكر ';
  String _30 =
      'لاتسخر ولا تستصغر ولا تهزأ بالناس، فلا تعلم كيف سيكون حالك غداً';
  String _31 = 'الضربات القوية تهشم الزجاج فقط لكنها تصقل الحديد';
  String _32 =
      'لا تجعل العالم يجعل منك إنساناً قاسياً ولا تجعل الألم يعلّمك الكره';
  String _33 = 'الشخص الذي لا يرتكب أي أخطاء لم يجرب أي شيء جديد';
  String _34 = 'أحياناً كثيرة يكون الطريق الصعب و الطّريق الصحيح شيئاً واحداً';
  String _35 = 'ثق فى نفسك فأنت تعرف أكثر مما تعتقد';
  String _36 =
      'من العجب أن تعرف قدر الخالق ولا تحبّه وأن تعرف قدر غضبه ثم تعصاه';
  String _37 = 'من زاد في حبه لنفسه زاد كره الناس له';
  String _38 = 'عامل الناس كما تحب أن تعامل';
  String _39 = 'كلمة واحدة طيّبة يمكنها أن تغيّر شخصاً للأفضل';
  String _40 = 'كل شئ إذا كثر رخص إلا الأدب فإنه إذا كثر غلا';
  String _41 =
      'الحياة مليئة بالحجارة فلا تتعثر بل أجمعها وأبنِ بها سلماً تصعد به نحو النجاح';
  String _42 = 'من أحب الله رأى كل شئ جميلاً';
  String _43 = 'تعلم قول لا أدري فإنك إن قلت لا أدري علموك حتى تدري';
  String _44 =
      'من يفقد ثروة يفقد كثيراً ومن يفقد صديقاً يفقد أكثر ومن يفقد الشجاعة يفقد كل شئ';
  String _45 = 'يوجد دآئمآً من هو أشقى منگ فإبتسم';
  List<String> _quotationList = [];

  getQutation(int i) {
    fillQuotationList();
    return _quotationList[i];
  }

  getLenght() {
    return _quotationList.length;
  }

  fillQuotationList() {
    _quotationList.add(_q1);
    _quotationList.add(_q2);
    _quotationList.add(_q3);
    _quotationList.add(_q4);
    _quotationList.add(_q5);
    _quotationList.add(_q6);
    _quotationList.add(_q7);
    _quotationList.add(_q8);
    _quotationList.add(_q9);
    _quotationList.add(_q10);
    _quotationList.add(_q11);
    _quotationList.add(_q12);
    _quotationList.add(_q14);
    _quotationList.add(_q15);
    _quotationList.add(_q16);
    _quotationList.add(_q17);
    _quotationList.add(_q18);
    _quotationList.add(_q20);
    _quotationList.add(_q21);
    _quotationList.add(_q22);
    _quotationList.add(_q23);
    _quotationList.add(_q24);
    _quotationList.add(_q25);
    _quotationList.add(_q26);
    _quotationList.add(_q27);
    _quotationList.add(_q28);
    _quotationList.add(_q29);
    _quotationList.add(_30);
    _quotationList.add(_31);
    _quotationList.add(_32);
    _quotationList.add(_33);
    _quotationList.add(_34);
    _quotationList.add(_35);
    _quotationList.add(_36);
    _quotationList.add(_37);
    _quotationList.add(_38);
    _quotationList.add(_39);
    _quotationList.add(_40);
    _quotationList.add(_41);
    _quotationList.add(_42);
    _quotationList.add(_43);
    _quotationList.add(_44);
    _quotationList.add(_45);
  }
}
